import dayjs from 'dayjs'
/* eslint-disable quotes */
export const eText = [
  "I Love You..〆(・∀・＊)",
  "Chocolate!( ・∀・)っ■",
  "(✿･ω･)/✉(//∇//)",
  "(◎_◎;)",
  "╮(╯3╰)╭",
  "(っ ̯ -｡)",
  "( ´･ω･)ﾉ(._.`)",
  "٩( ´︶` )( ´︶` )۶",
  "٩(*Ӧ)و",
  "ヾヾ( ˘ ³˘人)ヾ",
  "*:ஐ٩(๑´ᵕ`)۶ஐ:*",
  "(。＿ 。） ✎＿",
  "(๑╹ヮ╹๑)ﾉ",
  "﻿ε≡٩(๑&gt;₃&lt;)۶",
  ...[
    "( *︾▽︾)",
    "( *′д)/o(_ _)ozzZZ…",
    "இwஇ",
    "(′▽`ʃ♡ƪ)",
    "₍₍ (̨̡ ‾ᗣ‾ )̧̢ ₎₎",
    "´͈ ᵕ `͈",
    "˃̣̣̥᷄⌓˂̣̣̥᷅",
    "(ꈍ﹃ ꈍ)",
    "٩(๛ ˘ ³˘)۶♥",
    "(ʃƪ ˘ ³˘)",
    "ꈍ .̮ ꈍ",
    "~Ⴚ(●ტ●)Ⴢ~",
    "（\\#-_-)\\┯━┯",
    "٩͡[๏̯͡๏]",
  ], ...[
    "( ＿ ＿)ノ｜",
    " (｀･д･′)",
    "೭(˵ˉ̴͒ꇴˉ̴͒˵)౨",
    "╮(﹀_﹀”)╭",
    "(′д｀σ)σ",
    "(`･ω･′)ゞ",
    "(σ｀･ω･′)σ",
    "ヾ(´ _ ` )ง⁽'-'⁾",
    "ଘ(੭ˊᵕˋ)੭* ੈ✩",
    "(๑‾ ꇴ ‾๑)",
    "(•̀ᴗ•́)و ̑̑",
    "վ'ᴗ' ի",
    "ヾ（′▽｀*）ゝ",
    "（◎_x）",
  ], ...[
    "o（′益`）o",
    "(　/O｀）",
    "( ᖛ ̫ ᖛ )ʃ)",
    "(๑˘ ˘๑)",
    "˃̶͈",
    "ଘ(੭ˊ꒳​ˋ)੭✧",
    "(ง ื▿ ื)ว\t\t",
    "(„ಡωಡ„)",
    "❤ (ɔˆз(ˆ⌣ˆc)",
    "┏┛墓┗┓...(((m -__-)m",
    "(๑ŐдŐ)b",
    "ɿ(｡･ɜ･)ɾⓌⓗⓐⓣ？",
    "(ﾟ⊿ﾟ)ﾂ",
    "=͟͟͞͞=͟͟͞͞(●⁰ꈊ⁰● |||)"
  ], ...[
    "!!!!=͟͟͞͞(๑ò◊ó ﾉ)ﾉ",
    "!! (•' '• ۶)۶",
    "（｀へ´）",
    "（≧0≦）",
    "(☆▽☆)",
    "(/0￣)o",
    "(///￣皿￣)○～",
    "✧*｡٩(ˊωˋ*)و✧*｡",
    "٩(•̤̀ᵕ•̤́๑)ᵒᵏᵎᵎᵎᵎ",
    "(๑•̀ㅂ•́)و✧",
    "┬—┬ ノ( ' - 'ノ)",
    "(๑•̀ㅁ•́ฅ✧",
    "(/ω＼)",
    "...(｡•ˇ‸ˇ•｡) ..."
  ], ...[
    "(´∇ﾉ‘*)ノ",
    "(๑&gt;؂&lt;๑）",
    "ฅ( ̳• ◡ • ̳)ฅ",
    "ヾ(◍°∇°◍)ﾉﾞ",
    "ฅ՞•ﻌ•՞ฅ",
    "( ﾟдﾟ)つBye",
    "(o≖◡≖)",
    "(‾◡◝)",
    "ε = = (づ′▽`)づ",
    "ε(┬┬﹏┬┬)3",
    "( ﹁ ﹁ ) ~→",
    "_〆(´Д｀ )",
    "|_・)",
    "|･ω･｀)"
  ], ...[
    "ꉂ (๑¯ਊ¯)σ",
    "ฅ( ̳• ◡ • ̳)ฅ",
    "(｡･ω･｡)ﾉ♡",
    "( ´◔‸◔`)",
    "(๑&gt;؂&lt;๑）",
    "—●○◎-",
    "—⊂ZZZ⊃",
    "(=ＴェＴ=)",
    "(＃｀д´)ﾉ",
    "ヽ(｀⌒´メ)ノ",
    "*.。(๑･∀･๑)*.。",
    "(๑･`◡´･๑)",
    "(•‾⌣‾•)",
    "˛˛ꉂ ೭(˵¯̴͒ꇴ¯̴͒˵)౨”"
  ], ...[
    "＼_(･ω･`)",
    "=͟͟͞͞=͟͟͞͞三❆)'дº);",
    "⁽⁽ଘ( ˊᵕˋ )ଓ⁾⁾",
    "(◞‸◟ )",
    "(=̴̶̷̤̄ ₃ =̴̶̷̤̄)♡",
    ":(⁄ ⁄ᵒ̶̶̷́⁄⚰⁄ᵒ̶̶̷̀⁄ ⁄):",
    "(ˊᵒ̴̶̷̤ ꇴ ᵒ̴̶̷̤ˋ)",
    "(∩ᵒ̴̶̷̤⌔ᵒ̴̶̷̤∩)",
    "_(._.)_",
    "o(#￣▽￣)==O))￣▽￣\")o",
    "( ￣ ▽￣)o╭╯☆#╰ _─﹏─)╯",
    "(ಥ_ಥ)",
    "⚆_⚆",
    "（。&gt;︿&lt;）_θ"
  ], ...[
    "（/▽＼）",
    "§（*￣▽￣*）§",
    "T^T",
    "（p_-）",
    "( ͡° ͜ʖ ͡°)╯♂",
    "(•́ . •̀)",
    "(^。^)y-.。o○",
    "(●°u°●)​ 」",
    "∠( ﾟωﾟ)／",
    "('ω')( ε: )(.ω.)( :3 )",
    "(゜o゜(☆○=(-_- )",
    "ჰჰჰ❛‿❛ჴჴჴ",
    "(๑꒪ਊ꒪)σ",
    "╭(⊙o⊙)╮"
  ]
]
/**
 * 从数组中随机抽取一个元素
 */
export function randomFromArray(array: any[] = eText) {
  return array[Math.floor(Math.random() * array.length)]
}
// 获取星期几语录
export function getWeekdayText() {
  const arr = [`😛幸福周日❤️, 不要焦虑,离周一还有很多个小时`,
    `星期一😩: 没事没事，撑一下马上一周就过去了`,
    `星期二😧: 两天结束了，周三过完四舍五入又是一周！`,
    `星期三😐: 过半了过半了！再坚持下马上明天过完就是周五！`,
    `🔥🐔🐔🔥 KFC Fucking Crazy Thursday Vme50!!!一周终于快过去了！挺住！`,
    `😏周五！！！, 想想晚上准备吃点啥~`,
    `🤗快乐周六❤️, 开开心心睡个好觉！`,
  ]
  const weekday = dayjs().day()
  return arr[weekday]
}
// 返回随机称呼
export function getRandomName() {
  const arr = ['臭老婆', '佳猪🐷', '🐷🐷🐷', '老婆大人', '小野同学', '憨批老婆', '小宝贝']
  return arr[Math.floor(Math.random() * arr.length)]
}
